vlm/extension/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СрокСдачиЗаказчику</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ДатаРасчетаСрокаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ОбщийСрокИзготовленияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_СрокИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Documents/ЗаказКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
&ИзменениеИКонтроль("ТоварыЦенаПриИзменении")
Процедура бит_ТоварыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	ОчиститьСообщения();
	ПрименитьОплатуБонуснымиБаллами(, Истина);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты()); 
	#Вставка //БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024  
	СтруктураДействий.Вставить("бит_ПересчитатьЦенуСоСкидкой");
	#КонецВставки //БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024

	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	 
КонецПроцедуры

&НаСервере
&После("ПриСозданииНаСервере")
Процедура бит_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	//БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024 +

	НовыйЭлемент = Элементы.Добавить("бит_ЦенаСоСкидкой", Тип("ПолеФормы"), Элементы.Товары);
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_ЦенаСоСкидкой"; 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ТолькоПросмотр = ИСТИНА;
	
	//БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024 -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [20.03.2025 17:25:23] +        
	НовыйЭлемент = Элементы.Добавить("бит_ВоеннаяПриемка", Тип("ПолеФормы"), Элементы.ГруппаОсновное);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВоеннаяПриемка";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ВоеннаяПриемкаПриИзменении");  
	
	НоваяГруппа = Элементы.Добавить("бит_ГруппаВоеннаяПриемка", Тип("ГруппаФормы"),Элементы.ГруппаОсновное);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь; 
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("бит_НомерИзвещения", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НомерИзвещения";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	
	НовыйЭлемент = Элементы.Добавить("бит_ДатаИзвещения", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ДатаИзвещения";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	
	НовыйЭлемент = Элементы.Добавить("бит_НомерСпецификацииВП", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НомерСпецификацииВП";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	
	НовыйЭлемент = Элементы.Добавить("бит_ОригиналСпецификацииВППолучен", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ОригиналСпецификацииВППолучен";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;  
	
	НовыйЭлемент = Элементы.Добавить("бит_СрокСдачиЗаказчику", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СрокСдачиЗаказчику";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;  

	// -------------------
	НовыйЭлемент = Элементы.Вставить("бит_СтатусЗаказа", Тип("ПолеФормы"), Элементы.ГруппаСтатусПриоритет, Элементы.Приоритет);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СтатусЗаказа";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	// ----------- ТЧ товары
	НовыйЭлемент = Элементы.Добавить("бит_ТоварыИзготовлено", Тип("ПолеФормы"), Элементы.Товары);
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_Изготовлено"; 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ОтображатьВПодвале = Истина;  
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииВП");
	
	НовыйЭлемент = Элементы.Добавить("бит_ТоварыДатаИзготовления", Тип("ПолеФормы"), Элементы.Товары);
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_ДатаИзготовления"; 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	
	НовыйЭлемент = Элементы.Добавить("бит_ТоварыПроверено", Тип("ПолеФормы"), Элементы.Товары);
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_Проверено"; 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ОтображатьВПодвале = Истина;
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииВП");
	
	НовыйЭлемент = Элементы.Добавить("бит_ТоварыДатаПроверки", Тип("ПолеФормы"), Элементы.Товары);
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_ДатаПроверки"; 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;

	// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [20.03.2025 17:25:23] -  
	
	// Первыйбит ЛТ3.10 ЛапшовГ "GVLapshov@1cbit.ru" 03.03.2025  +
	НовыйЭлемент = Элементы.Добавить("бит_НомерСделкиИзККСС", Тип("ПолеФормы"), Элементы.ГруппаОсновное);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НомерСделкиИзККСС";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	// Первыйбит ЛТ3.10 ЛапшовГ "GVLapshov@1cbit.ru" 03.03.2025  - 

	НовыйЭлемент = Элементы.Добавить("бит_ЗаказКапитал", Тип("ПолеФормы"), Элементы.ГруппаОсновное);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ЗаказКапитал";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	
	
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	НовыйЭлемент = Элементы.Добавить("бит_ТоварыВесНетто", Тип("ПолеФормы"), Элементы.Товары); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_ВесНетто"; 
	НовыйЭлемент.ТолькоПросмотр = Истина;
    Элементы.Переместить(НовыйЭлемент, Элементы.Товары, Элементы.ТоварыВидЦены);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -  
	
	// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [17.03.2026 9:01:37] +        
	НовыйЭлемент = Элементы.Добавить("бит_ТоварыВесБрутто", Тип("ПолеФормы"), Элементы.Товары); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_ВесБрутто"; 
	НовыйЭлемент.ТолькоПросмотр = Истина;
    Элементы.Переместить(НовыйЭлемент, Элементы.Товары, Элементы.ТоварыВидЦены);

	// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [17.03.2026 9:01:37] -
	
	// {{ПервыйБИТ ЛистТребований [3.1]  [VUVaynula@1cbit.ru] [18.05.2025 13:30:11] +        
	НоваяКоманда = ЭтаФорма.Команды.Добавить("РассчитатьСрокиИзготовления");
	НоваяКоманда.Заголовок = "Рассчитать сроки изготовления";
	НоваяКоманда.Действие = "РассчитатьСрокиИзготовления";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Вставить("РассчитатьСрокиИзготовления", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель, Элементы.ТоварыВыделитьВсе);
	НовыйЭлемент.Заголовок = "Рассчитать сроки изготовления";
	НовыйЭлемент.ИмяКоманды = "РассчитатьСрокиИзготовления";            
	
	НовыйЭлемент = Элементы.Вставить("бит_ТоварыСрокИзготовления", Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыСерия); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_СрокИзготовления"; 
	
	НовыйЭлемент = Элементы.Добавить("бит_ОбщийСрокИзготовленияЗаказа", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ОбщийСрокИзготовленияЗаказа";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;

	НовыйЭлемент = Элементы.Вставить("бит_ДатаРасчетаСрокаЗаказа", Тип("ПолеФормы"), Элементы.ГруппаОсновное, Элементы.ГруппаПодпискаНаОповещения);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ДатаРасчетаСрокаЗаказа";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	// }}ПервыйБИТ ЛистТребований [3.1]  [VUVaynula@1cbit.ru] [18.05.2025 13:30:11] - 
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 16:39:16] +        
	НовыйЭлемент = Элементы.Добавить("бит_НеУдалосьПодобратьТаруПриЗагрузке", Тип("ПолеФормы"), Элементы.ГруппаПараметрыПраво);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НеУдалосьПодобратьТаруПриЗагрузке";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	
	НовыйЭлемент = Элементы.Добавить("Товарыбит_Тара", Тип("ПолеФормы"), Элементы.Товары); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_Тара";
	НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
	НовыйЭлемент.КнопкаВыбора = Истина;
	НовыйЭлемент.ОтображениеКНопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать; 
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииТары");
	//Элементы.Переместить(НовыйЭлемент, Элементы.Товары, Элементы.ТоварыВидЦены);

	// }}ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 16:39:16] -  
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [30.03.2026 4:52:31] +        
	НовыйЭлемент = Элементы.Вставить("бит_Толеранс", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво, Неопределено);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Толеранс";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;                     
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииТолеранса");
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [30.03.2026 4:52:31] -
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСрокиИзготовления(Команда)
// {{ПервыйБИТ ЛистТребований [3.1]  [VUVaynula@1cbit.ru] [18.05.2025 13:36:58] +   
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сначала необходимо записать заказ");
		Возврат; 
	КонецЕсли;
	
	ПФ = Новый Структура; 
	ПФ.Вставить("Ключ", Объект.Ссылка); 
	//ПФ.Вставить("АдресТаблицыТоваров", ПодготовитьТаблицуТоваров());                                                       
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеРасчетаСроковПроизводства", ЭтотОбъект);
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.бит_ФормаРасчетаСрокаИзготовления", ПФ, ЭтаФорма, УникальныйИдентификатор, , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
// }}ПервыйБИТ ЛистТребований [3.1]  [VUVaynula@1cbit.ru] [18.05.2025 13:36:58] -
КонецПроцедуры                                      

&НаКлиенте
Процедура ПослеРасчетаСроковПроизводства(Результат, ДопПараметры) Экспорт
	// {{ПервыйБИТ ЛистТребований [3.1]  [VUVaynula@1cbit.ru] [22.05.2025 22:35:36] +        
	Если ТипЗнч(Результат) = Тип("Соответствие") Тогда                
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("НомерСтроки");
		Объект.бит_ОбщийСрокИзготовленияЗаказа = Дата("00010101");
		Для каждого стр из Результат Цикл
			СтруктураПоиска.НомерСтроки = стр.Ключ;
			СтрокаПоКлючу = Объект.Товары.НайтиСтроки(СтруктураПоиска);
			СтрокаПоКлючу[0].ДатаОтгрузки = стр.Значение; 
			СтрокаПоКлючу[0].бит_СрокИзготовления = СтрокаПоКлючу[0].ДатаОтгрузки;
			Объект.бит_ОбщийСрокИзготовленияЗаказа = Макс(Объект.бит_ОбщийСрокИзготовленияЗаказа, стр.Значение);
		КонецЦикла;   
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [3.1]  [VUVaynula@1cbit.ru] [22.05.2025 22:35:36] -
КонецПроцедуры

//&НаСервере
//Функция ПодготовитьТаблицуТоваров()
//	
//	Возврат ПоместитьВоВременноеХранилище(Объект.Товары.Выгрузить(, "НомерСтроки, Номенклатура, Количество"));

//КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ТоварыВидЦеныПриИзменении")
Процедура бит_ТоварыВидЦеныПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	ОчиститьСообщения();
	ПрименитьОплатуБонуснымиБаллами(, Истина);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());  
	#Вставка //БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024  
	СтруктураДействий.Вставить("бит_ПересчитатьЦенуСоСкидкой");
	#КонецВставки //БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024

	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыПроцентРучнойСкидкиПриИзменении")
Процедура бит_ТоварыПроцентРучнойСкидкиПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	ОчиститьСообщения();
	ПрименитьОплатуБонуснымиБаллами(, Истина);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	#Вставка //БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024  
	СтруктураДействий.Вставить("бит_ПересчитатьЦенуСоСкидкой");
	#КонецВставки //БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024

	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыСуммаРучнойСкидкиПриИзменении")
Процедура бит_ТоварыСуммаРучнойСкидкиПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	ОчиститьСообщения();
	ПрименитьОплатуБонуснымиБаллами(, Истина);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьПроцентРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать, ПересчитыватьСуммуРучнойСкидки", Ложь, Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());  
	#Вставка //БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024  
	СтруктураДействий.Вставить("бит_ПересчитатьЦенуСоСкидкой");
	#КонецВставки //БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024

	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыСуммаПриИзменении")
Процедура бит_ТоварыСуммаПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	ОперацииПередачи = ОперацииПередачиТоваров();
	ПередачаТоваров = ОперацииПередачи.Найти(Объект.ХозяйственнаяОперация) <> Неопределено;
	
	СтруктураПересчетаЦены  = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВПродажахВТЧ(Объект,
		ПередачаТоваров);
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВПродажах", СтруктураПересчетаЦены);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты()); 
	#Вставка //БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024  
	СтруктураДействий.Вставить("бит_ПересчитатьЦенуСоСкидкой");
	#КонецВставки //БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024

	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыСуммаНДСПриИзменении")
Процедура бит_ТоварыСуммаНДСПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты()); 
	#Вставка //БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024  
	СтруктураДействий.Вставить("бит_ПересчитатьЦенуСоСкидкой");
	#КонецВставки //БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024

	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура бит_ВоеннаяПриемкаПриИзменении(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [20.03.2025 17:32:51] +        
	бит_ВидимостьВП(); 
	// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [20.03.2025 17:32:51] -
КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииВП(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [22.03.2025 0:39:04] +        
	ПересчитатьИтогиВоеннаяПриемка();
	// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [22.03.2025 0:39:04] -
КонецПроцедуры                   

&НаКлиенте
Процедура бит_ВидимостьВП()
	// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [22.03.2025 0:36:32] +        
	ВоеннаяПриемка = Объект.бит_ВоеннаяПриемка;
	Элементы.бит_ГруппаВоеннаяПриемка.Видимость = ВоеннаяПриемка; 
	Элементы.бит_ТоварыИзготовлено.Видимость 	= ВоеннаяПриемка;
	Элементы.бит_ТоварыДатаИзготовления.Видимость = ВоеннаяПриемка;
	Элементы.бит_ТоварыПроверено.Видимость 		= ВоеннаяПриемка;
	Элементы.бит_ТоварыДатаПроверки.Видимость 	= ВоеннаяПриемка;  
	Элементы.Товары.Подвал = ВоеннаяПриемка;
	Если ВоеннаяПриемка Тогда 
		ПересчитатьИтогиВоеннаяПриемка();
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [22.03.2025 0:36:32] -
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиВоеннаяПриемка()
	// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [20.03.2025 17:32:51] +        
	ИтогИзготовлено = "";
	ИтогПроверено = "";                    
	Изготовлено = 0;
	Проверено = 0;
	
	Если Объект.бит_ВоеннаяПриемка Тогда
		
		Для Каждого стр Из Объект.Товары Цикл
			Если стр.бит_Изготовлено Тогда 
				Изготовлено = Изготовлено + 1;
			КонецЕсли;
			Если стр.бит_Проверено Тогда
				Проверено = Проверено + 1;
			КонецЕсли;
		КонецЦикла;	
		
		ВсегоСтрок = Объект.Товары.Количество(); 
		
		// Рассчитывается как отношение количества номенклатурных позиций с установленным признаком «Изготовлено» 
		// к общему количеству строк в табличной части.
		//  Формула: (Количество строк с признаком "Изготовлено" / Общее количество строк) * 100.
		ИтогИзготовлено = Окр((Изготовлено / ВсегоСтрок) * 100, 2);
		ИтогПроверено 	= Окр((Проверено   / ВсегоСтрок) * 100, 2);     
		
	КонецЕсли;  
	
	Элементы.бит_ТоварыИзготовлено.ТекстПодвала = ИтогИзготовлено; 
	Элементы.бит_ТоварыПроверено.ТекстПодвала = ИтогПроверено; 
	// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [20.03.2025 17:32:51] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ПриОткрытииПосле(Отказ)
	// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [22.03.2025 0:34:07] +        
	бит_ВидимостьВП();
	// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [22.03.2025 0:34:07] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ТоварыПриИзмененииПосле(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [22.03.2025 0:47:11] +        
	Если Объект.бит_ВоеннаяПриемка Тогда
		ПересчитатьИтогиВоеннаяПриемка();
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [22.03.2025 0:47:11] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [22.03.2025 0:47:11] +        
	Если Объект.бит_ВоеннаяПриемка Тогда
		ПересчитатьИтогиВоеннаяПриемка();
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [22.03.2025 0:47:11] -
КонецПроцедуры

&После("ТоварыНоменклатураПартнераПриИзменении")
&НаКлиенте
Процедура бит_ТоварыНоменклатураПартнераПриИзмененииПосле(Элемент)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 + 
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	бит_РасчитатьВес(ТекущиеДанные);
    // Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

&После("ТоварыНоменклатураПриИзменении")
&НаКлиенте
Процедура бит_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 + 
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	бит_РасчитатьВес(ТекущиеДанные);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -    
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 16:44:26] +    
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ТекущиеДанные.бит_Тара = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "бит_СтандартныйТипТары");
	Иначе                        
		ТекущиеДанные.бит_Тара = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 16:44:26] -
КонецПроцедуры

&После("ТоварыКоличествоУпаковокПриИзменении")
&НаКлиенте
Процедура бит_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 + 
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	бит_РасчитатьВес(ТекущиеДанные);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

&После("РазбитьСтрокуЗавершение")
&НаКлиенте
Процедура бит_РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры) Экспорт
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если НоваяСтрока <> Неопределено Тогда
		бит_РасчитатьВес(ТекущаяСтрока);
		бит_РасчитатьВес(НоваяСтрока);
	КонецЕсли;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

&После("ЗагрузитьИзВнешнегоФайлаЗавершение")
&НаКлиенте
Процедура бит_ЗагрузитьИзВнешнегоФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Для каждого Строка Из Объект.Товары Цикл
		бит_РасчитатьВес(Строка)
	КонецЦикла;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры 

&После("ОбработкаВыбора")
&НаКлиенте
Процедура бит_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
   // Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Для каждого Строка Из Объект.Товары Цикл
		бит_РасчитатьВес(Строка)
	КонецЦикла;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

&После("ТоварыВариантОбеспеченияПриИзмененииПослеВопроса")
&НаКлиенте
Процедура бит_ТоварыВариантОбеспеченияПриИзмененииПослеВопроса(Ответ, ДополнительныеПараметры)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Для каждого Строка Из Объект.Товары Цикл
		бит_РасчитатьВес(Строка)
	КонецЦикла;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

&После("ТоварыВариантОбеспеченияОбработкаВыбора")
&НаКлиенте
Процедура бит_ТоварыВариантОбеспеченияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Для каждого Строка Из Объект.Товары Цикл
		бит_РасчитатьВес(Строка)
	КонецЦикла;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -	
КонецПроцедуры 

&После("ТоварыВариантОбеспеченияПриИзменении")
&НаКлиенте
Процедура бит_ТоварыВариантОбеспеченияПриИзменении(Элемент)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Для каждого Строка Из Объект.Товары Цикл
		бит_РасчитатьВес(Строка)
	КонецЦикла;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -	
КонецПроцедуры 	

&После("ОбеспечениеУстановитьДействиеСВопросом")
&НаКлиенте
Процедура бит_ОбеспечениеУстановитьДействиеСВопросом(КодДействия)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Для каждого Строка Из Объект.Товары Цикл
		бит_РасчитатьВес(Строка)
	КонецЦикла;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -	
КонецПроцедуры	
	
&НаКлиенте
Процедура бит_РасчитатьВес(ТекущиеДанные)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Если ТекущиеДанные <> Неопределено Тогда
		
		ВесНетто = бит_ПолучитьВесНоменклатуры(ТекущиеДанные.Номенклатура, ТекущиеДанные.Упаковка);
		ТекущиеДанные.бит_ВесНетто = ВесНетто * ТекущиеДанные.КоличествоУпаковок;
		
		// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [17.03.2026 9:03:19] +        
		Если ЗначениеЗаполнено(ТекущиеДанные.бит_Тара) Тогда
			ВесТары = бит_ПолучитьВесНоменклатуры(ТекущиеДанные.бит_Тара, ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.бит_Тара, "ЕдиницаИзмерения"));
		Иначе         
			ВесТары = 0;
		КонецЕсли;
		ТекущиеДанные.бит_ВесБрутто = ТекущиеДанные.бит_ВесНетто + ВесТары;
		// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [17.03.2026 9:03:19] -
	КонецЕсли;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры
	
 &НаСервере
Функция бит_ПолучитьВесНоменклатуры(Номенклатура, Упаковка)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Возврат Номенклатура.ВесЧислитель;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецФункции

&НаСервере
&ИзменениеИКонтроль("ОбработкаВыбораПодборНаСервере")
Процедура бит_ОбработкаВыбораПодборНаСервере1(ВыбранноеЗначение)

	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект, Истина));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьСодержание", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	Если Объект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала Тогда
		СтруктураДействий.Вставить("ЗаполнитьПодразделениеВСтрокеТЧ", Новый Структура("Подразделение", Объект.Подразделение));
	КонецЕсли;

	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());

	ДобавитьДействияОбеспеченияНаСервере(СтруктураДействий, "СкладОбязателен,ДатаОтгрузкиОбязательна");

	НачалоДня = НачалоДня(ТекущаяДатаСеанса());

	ПоляДляЗаполнения = "НоменклатураНабора, ХарактеристикаНабора, Номенклатура, Характеристика, Упаковка, Склад, ДатаОтгрузки, 
	|ВидЦены, Цена, КоличествоУпаковок, Количество, Сумма, СуммаНДС, СуммаСНДС, СуммаРучнойСкидки, ПроцентРучнойСкидки, 
	|СрокПоставки, ВариантОбеспечения, Обособленно, Серия";
	ПоляПоиска = "НоменклатураНабора, ХарактеристикаНабора, Номенклатура, Характеристика, Упаковка, Склад, ДатаОтгрузки, 
	|ВидЦены, ВариантОбеспечения, Обособленно, Серия, Цена";
	ПараметрыОтбора = Новый Структура(ПоляПоиска);
	ОбрабатываемыеСтроки = Новый Массив;
	ДатыОтгрузки = Новый Соответствие;

	ТребуетсяПересчетУпаковок = Ложь;
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл

		Если ЗначениеЗаполнено(СтрокаТовара.НоменклатураНабора) Тогда
			// Для наборов следует увеличивать количество в строках набора, которые уже добавлены в ТЧ.

			ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаТовара);
			НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыОтбора);

			Если НайденныеСтроки.Количество() > 0 Тогда
				ТекущаяСтрока = НайденныеСтроки[0];
				ТекущаяСтрока.Количество = ТекущаяСтрока.Количество + СтрокаТовара.Количество;
				ТребуетсяПересчетУпаковок = Истина;
			Иначе
				ТекущаяСтрока = Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, ПоляДляЗаполнения);
			КонецЕсли;
		Иначе
			// Для не-наборов следует всегда добавлять новую строку, независимо от наличия такого товара в ТЧ.

			ТекущаяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, ПоляДляЗаполнения);
		КонецЕсли;

		ТекущаяСтрока.ИндексНабора = ?(ЗначениеЗаполнено(ТекущаяСтрока.НоменклатураНабора), 1, 0);
		ОбрабатываемыеСтроки.Добавить(ТекущаяСтрока);
		ДатыОтгрузки.Вставить(ТекущаяСтрока, СтрокаТовара.ДатаОтгрузки);

	КонецЦикла;
	Если ТребуетсяПересчетУпаковок Тогда
		СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	КонецЕсли;

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
	ОбрабатываемыеСтроки,
	СтруктураДействий,
	Объект.Товары,
	КэшированныеЗначения);

	Для Каждого ТекущаяСтрока Из ОбрабатываемыеСтроки Цикл

		ТекущаяСтрока.ДатаОтгрузки = ОбеспечениеВДокументахСервер.ДатаОтгрузкиОбработкаВыбораПодбор(
		ДатыОтгрузки.Получить(ТекущаяСтрока),
		ТекущаяСтрока.ВариантОбеспечения,
		НачалоДня);
		#Вставка     
		// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 17:33:37] +        
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Склад) и ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура.бит_Склад) Тогда
			ТекущаяСтрока.Склад = ТекущаяСтрока.Номенклатура.бит_Склад;
		КонецЕсли;
		// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 17:33:37] -
		#КонецВставки

	КонецЦикла;

	ОбеспечениеВДокументахСервер.АктуализироватьДатуОтгрузкиОднойДатой(
	Объект.НеОтгружатьЧастями,
	Объект.ДатаОтгрузки,
	Объект.Товары,
	"ДатаОтгрузки");
	ОбновитьКолонкуДоступноСервер();

	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);

	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыНоменклатураПриИзменении")
Процедура бит_ТоварыНоменклатураПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);

	ОчиститьСообщения();
	ПрименитьОплатуБонуснымиБаллами(, Истина);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект, Истина));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	СтруктураДействий.Вставить("ЗаполнитьСодержание", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
	ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий,
	"ВариантОбеспечения,ДоступноВДругихСтроках,СкладОбязателен,ДатаОтгрузкиОбязательна");
	ДобавитьДействиеЗаполненияЦен(СтруктураДействий);

	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
	ЭтаФорма.ИмяФормы, "Товары"));
	Если Объект.ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоставкаПодПринципала") Тогда
		СтруктураДействий.Вставить("ЗаполнитьПодразделениеВСтрокеТЧ", Новый Структура("Подразделение", Объект.Подразделение));
	КонецЕсли;

	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	#Вставка     
	// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 17:33:37] +        
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Склад) и ЗначениеЗаполнено(ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Номенклатура, "бит_Склад")) Тогда
		ТекущаяСтрока.Склад = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Номенклатура, "бит_Склад");
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 17:33:37] -
	#КонецВставки

	Если ОбеспечениеВДокументахКлиент.ТребуетсяОбновитьКолонкуДоступно(СтруктураДействий) Тогда
		ОбновитьКолонкуДоступноСервер();
	КонецЕсли;

	ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииТары(Элемент)
	// {{ПервыйБИТ ЛистТребований [Исправление после сквозного]  [VUVaynula@1cbit.ru] [18.03.2026 12:47:37] +  
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	бит_РасчитатьВес(ТекущиеДанные);
	// }}ПервыйБИТ ЛистТребований [Исправление после сквозного]  [VUVaynula@1cbit.ru] [18.03.2026 12:47:37] -
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииТолеранса(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [30.03.2026 4:54:02] +        
	СинхронизацияЗначенияТолерансаВРеквизитеИКомментарии();
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [30.03.2026 4:54:02] -
КонецПроцедуры  

&НаКлиенте
Процедура СинхронизацияЗначенияТолерансаВРеквизитеИКомментарии()
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 22:02:01] +        
	//Если ЗначениеЗаполнено(Объект.бит_Толеранс) Тогда
	//	Если ПустаяСтрока(Объект.Комментарий) Тогда
	//		Объект.Комментарий = "Толеранс:"+Объект.бит_Толеранс+"%";
	//	Иначе 
	//		Объект.Комментарий = СкорректироватьКомментарийиНаСервереБезКонтекста(Объект.бит_Толеранс, Объект.Комментарий);		
	//	КонецЕсли;
	//КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 22:02:01] -
КонецПроцедуры

&НаСервереБезКонтекста
Функция СкорректироватьКомментарийиНаСервереБезКонтекста(знач бит_Толеранс, знач Комментарий) 
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [30.03.2026 5:31:43] +        
	РегулярноеВыражение = "(Толеранс\s*:\s*)\d+(?:\.\d+)?(\s*%)";
	ПодстрокаЗамены = "$1" + Строка(бит_Толеранс) + "$2";

	Возврат СтрЗаменитьПоРегулярномуВыражению(Комментарий, РегулярноеВыражение, ПодстрокаЗамены, Истина, Ложь);
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [30.03.2026 5:31:43] -	
КонецФункции

&НаКлиенте
Процедура бит_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 22:01:08] +        
	//СинхронизацияЗначенияТолерансаВРеквизитеИКомментарии();	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 22:01:08] -
КонецПроцедуры
